Repository: PabloGamiz/SafeEvents-Frontend
Catalog: lib/l10n/app_*.arb
Languages: ca, es

# seleccionaelnombredentradeserror
source: The number of tickets you try to book or buy is greater than the number of tickets available
ca: El nombre d’entrades que intenteu reservar o comprar és superior al nombre d’entrades disponibles
es: Select the desired number of entries

# avis_reserva
source: If you choose to book you must keep in mind that tickets will only be booked for 24 hours.
ca: Si selecciones reservar has de tenir en compte que les entrades només es reservaran per 24 hores.
es: Si seleccionas reservar debes tener en cuenta que las entradas sólo se reservarán por 24 horas.

# proces_compra
source: Processing purchase, please wait.
ca: S'està processant la compra, si us plau esperi.
es: Se está procesando la compra, por favor espere.

source: Hello World!
ca: Hola món!
es: Hola mundo!

source: SignIn
ca: Iniciar sessió
es: Iniciar sessión

# signInButton
source: Sign-In with Google
ca: Iniciar sessió amb Google
es: Iniciar sessión con Google

# entradesDisponibles
source: tickets available
ca: entrades disponibles
es: entradas disponibles

# cercarciutat
source: Search location
ca: Cercar localització
es: Buscar localización

# noesdeveniments
source: No event matching with the location or category indicated
ca: Cap esdeveniment coincideix amb la localització o categoria seleccionada
es: Ningún evento coincide con la localización o categoría seleccionada

# missatgechat
source: Write a message
ca: Escriu un missatge
es: Escribe un mensaje

# sharemessage1
source: I've bought tickets for the event
ca: He comprat entrades per a l'esdeveniment
es: He comprado entradas para el evento

# sharemessage2
source: throught the application SafeEvents
ca: amb l'aplicació SafeEvents
es: a través de la aplicación SafeEvents

# sharemessage
source: I've bought tickets for the event $eventName throught the application SafeEvents
ca: He comprat entrades per a l'esdeveniment $eventName amb l'aplicació SafeEvents
es: He comprado entradas para el evento $eventName con la aplicacion SafeEvents

# courseentrades
source: Number of selected entries:
ca: Nombre d'entrades seleccionades:
es: Número de entradas seleccionadas:

# reservaButton
source: Book tickets
ca: Reserva d’entrades
es: Reservar entradas

# compraButton
source: Buy tickets
ca: Comprar tiquets
es: Comprar entradas

# entrades
source: Tickets
ca: Tiquets
es: Entradas

# entrades_disponibles
source: Tickets available
ca: Tiquets disponibles
es: Entradas disponibles

# seleccionar_entrades
source: Select tickets
ca: Seleccionar entrades
es: Seleccionar entradas

# okey_button
source: Okey
ca: D'acord
es: De acuerdo

# avis
source: Notice
ca: Avís
es: Aviso

# continuar_button
source: Continue
ca: Continuar
es: Continuar

# error_accio
source: The action could not be performed, please try again
ca: No s'ha pogut dur a terme l'acció, torneu-ho a provar
es: No se pudo realizar la acción, intente nuevamente

# confirmacio_reserva1
source: The
ca: S'ha fet la reserva correctament de les
es: Se ha hecho la reserva correctamente de las

# confirmacio_reserva2
source: tickets have been booked correctly
ca: entrades
es: entradas

# confirmacio_compra1
source: The
ca: S'ha fet la compra correctament de les
es: Se ha hecho la compra correctamente de las

# confirmacio_compra2
source: tickets have been successfully purchased
ca: entrades
es: entradas

# seleccionaelnombredentrades
source: Select the desired number of entries
ca: Seleccioneu el nombre d’entrades desitjattice
es: La cantidad de entradas que intenta reservar o comprar es mayor que la cantidad de entradas disponibles

# noFavsMessage
source: You have no favourites. Hit the ❤️ to add one.
ca: No tens cap favorit. Selecciona el ❤️ per afegir un.
es: No tienes favoritos. Selecciona el ❤️ para añadir uno.

# avisscanning
source: Scanning is being performed, to cancel press the button below
ca: S'està fent l'escaneig, per cancel·lar prémer el botó de sota
es: Se está realizando el escaneo, para cancelar pulsar el botón de abajo

# stopscanning
source: Press to stop the scanner
ca: Prémer per aturar l'escàner
es: Pulsar para detener el escáner

source: Scanning
ca: Escanejant
es: Escaneando

# errorcamara1
source: Camera permission was denied
ca: S'ha denegat el permís de la càmera
es: Se denegó el permiso de la cámara

# errorcamara2
source: Unknown Error
ca: Error desconegut
es: Error desconocido

# errorcamara3
source: You pressed the back button before scanning anything
ca: Heu premut el botó enrere abans d’escanejar res
es: Presionó el botón de retroceso antes de escanear cualquier cosa

# funcionalitat_no_disponible
source: Functionality not available
ca: Funcionalitat no disponible
es: Funcionalidad no disponible

# bottomContentText
source: If you would like to access this feature please sign in with Google
ca: Si vols accedir a aquesta funcionalitat si us plau inicia sessió amb Google
es: Si quieres acceder a esta funcionalidad por favor inicia sesión con Google

source: Sign in
ca: Iniciar sessio
es: Iniciar sesión

source: Select state
ca: Seleccioneu l'estat
es: Seleccione estado

source: UNKNOWN
ca: DESCONEGUT
es: DESCONOCIDO

source: POSITIVE
ca: POSITIU
es: POSITIVO

source: NEGATIVE
ca: NEGATIU
es: NEGATIVO

# favsErrorMessage
source: There was an error while retrieving your favourites. Please try again later.
ca: Ha succeït un error. Si us plau, torna a intentar-ho més tard.
es: Ha habido un error al obtener los favoritos. Por favor vuelve a intentarlo mas tarde.

# bookingsClientInfo
source: Bookings
ca: Reserves
es: Reservas

# ticketsClientInfo
source: Tickets
ca: Entrades
es: Entradas

# organizedClientInfo
source: Organized events
ca: Esdeveniments organitzats
es: Eventos organizados

# errorClientInfo
source: There was an error while retrieving your data.
ca: Ha succeït un error en obtenir les teves dades.
es: Ha habido un error al obtener tu informacion.

# noTickets
source: You don't have
ca: No tens
es: No tienes

# noOrgEvents
source: You don't organize any event.
ca: No organitzes cap esdeveniment
es: No organizas ningun evento

# mapsHintText
source: Direcció de l'Esdeveniment
es: Direccion del evento

source: No results
ca: No hi ha resultats
es: No hay resultados

source: CONTACT
ca: CONTACTA
es: CONTACTA

# feedback
source: GIVE US SOME FEEDBACK
ca: DONA'NS FEEDBACK DE L'ESDEVENIMENT
es: DANOS FEEDBACK DEL EVENTO

# covid
source: Check the COVID prevention measures
ca: Consulta les mesures de prevenció del COVID
es: Consulta las medidas de prevencion del COVID

# serveis
source: SERVICES
ca: SERVEIS
es: SERVICIOS

# reservacompra
source: BOOK NOW
ca: RESERVA / COMPRA
es: RESERVA / COMPRA

# puntua
source: RATE THIS EVENT
ca: PUNTUA L'ESDEVENIMENT
es: PUNTUA EL EVENTO

source: Select category
ca: Selecciona categoria
es: Selecciona categoria

# musica
source: Music
ca: Música
es: Música

# teatre
source: Theatre
ca: Teatre
es: Teatro

# esport
source: Sport
ca: Esport
es: Deporte

source: Art
es: Arte

# altres
source: Others
ca: Altres
es: Otros

# warnbackpublish
source: If you go back, event will be not published Are you sure?
ca: Si tornes enrere no es publicarà l'Esdeveniment N'estàs segur/a?
es: Si vuelves atrás no se publicará el evento ¿Estas seguro?

# si
source: Yes
ca: Sí
es: Sí

# nomesdev
source: Name of the Event
ca: Nom Esdeveniment
es: Nombre del Evento

# errornom
source: Event's name should be reported
ca: El Nom de l'esdeveniment ha d'estar informat
es: El Nombre del evento debe estar informado

# errordir
source: Event's adress should be reported
ca: La direcció de l'esdeveniment ha d'estar informada
es: La direccion del evento debe estar informada

# errorpreu
source: Event's price should be reported
ca: El Preu de l'esdeveniment ha d'estar informat
es: El Precio del evento debe estar informado

# errortipus
source: This is not a valid event type
ca: No és un tipus d'esdeveniment vàlid
es: No es un tipo de evento válido

# errordatahora
source: Event's date and hour should be reported
ca: La data i l'hora de l'esdeveniment han d'estar informades
es: La fecha y la hora del evento deben estar informadas

# errorcap
source: Event's capacity should be reported
ca: La capacitat ha d'estar informada
es: La capacidad del evento debe estar informada

# descr
source: Event's description
ca: Descripció de l'Esdeveniment
es: Descripción del Evento

# addserv
source: Add all offered services
ca: Afegeix els serveis que s'ofereixen
es: Añade los servicios que se ofrecen

# addservwarn
source: Add one service per line
ca: Afegeix un servei per línia
es: Añade un servicio por línia

# introdueixdir
source: Introduce the adress
ca: Introdueix la direcció
es: Introduce la dirección

# noresults
source: There is no results
ca: No hi han resultats
es: No hay resultados

# preueneu
source: Price (in €)
ca: Preu (en €)
es: Precio (en €)

# capacitatesd
source: Event's capacity
ca: Capacitat de l'esdeveniment
es: Capacidad del evento

# enllimg
source: Add an image link
ca: Afegeix un enllaç d'imatge
es: Añade un enlace de imagen

# enllimgwarn
source: The image must be upload on the internet
ca: Per afegir una imatge és obligatori que estigui pujada a internet
es: Para añadir una imagen es obligatorio que esté subida a internet

# esculltipusesd
source: Choose an event type
ca: Escull el tipus d'esdeveniment
es: Escoge un tipo de evento

# intrdata
source: Introduce the event's date
ca: Introdueix la Data de l'Esdeveniment
es: Introduce la Fecha del Evento

# intrhora
source: Introduce the event's hour
ca: Introdueix l'hora de l'Esdeveniment
es: Introduce la hora del Evento

# publica
source: Publish
ca: Publica
es: Publica

# warnbackmodif
source: If you go back, event will be not modified Are you sure??
ca: Si tornes enrere no es modificarà l'Esdeveniment N'estàs segur/a?
es: Si vuelves atrás no se modificará el evento ¿Estas seguro?

# actualitza
source: Modify
ca: Modifica
es: Modifica

# tots
source: All
ca: Tots
es: Todos

# scategory
source: Select a category
ca: Selecciona una categoria
es: Selecciona una categoria

# startscanning
source: Inicio del escáner
ca: Inici de l'escàner
